Handling sql with pandas

Importing necessary libraries

In [7]:
import pandas as pd
import sqlite3

setting up the database

In [8]:
conn = sqlite3.connect('company_sales.db')
c = conn.cursor()

In [12]:
c.execute('''
CREATE TABLE sales_data(
    date TEXT,
    region TEXT,
    product TEXT,
    quantity INTEGER,
    price REAL,
    service_receptionist TEXT
)''')

In [13]:
sales = [
    ("2025-11-01", "North", "Laptop", 5, 1200.50, "Emily Clark"),
    ("2025-11-02", "South", "Smartphone", 10, 699.99, "James Lee"),
    ("2025-11-03", "East", "Headphones", 15, 89.99, "Olivia Brown"),
    ("2025-11-04", "West", "Tablet", 8, 450.00, "Noah Wilson"),
    ("2025-11-05", "Central", "Monitor", 12, 299.49, "Sophia Davis")
]

In [14]:
c.executemany('INSERT INTO sales_data VALUES (?, ?, ?, ?, ?, ?)', sales)

now that data is loaded lets query sql

In [15]:
pd.read_sql_query('SELECT * FROM sales_data', conn)

         date   region     product  quantity    price service_receptionist
0  2025-11-01    North      Laptop         5  1200.50          Emily Clark
1  2025-11-02    South  Smartphone        10   699.99            James Lee
2  2025-11-03     East  Headphones        15    89.99         Olivia Brown
3  2025-11-04     West      Tablet         8   450.00          Noah Wilson
4  2025-11-05  Central     Monitor        12   299.49         Sophia Davis